artefacts/load-testing/positionreport-feed-test.yml
config:
  target: "{{ $processEnvironment.geotracking_http_url }}"
  phases:
    - duration: 60
      arrivalRate: 20
  processor: "./generatepositionreports.js"
  defaults:
    headers:
      content-type: 'application/json'
scenarios:
  - flow:
    - function: "generateRandomData"
    - post:
        url: "/"
        headers:
          x-functions-key: "{{ $processEnvironment.geotracking_http_key }}"
        json:
          shipId: "{{ shipId }}"
          source: "{{ source }}"
          timestamp: "{{ timestamp }}"
          longitude: "{{ longitude }}"
          latitude: "{{ latitude }}"
    - log: "Sent a request for {{ shipId }} with long {{ longitude }} lat {{ latitude }} on {{ timestamp }}"